In [1]:
import pandas as pd

In [3]:
countries = ['USA','Nigra','France','Ghana']
data = [100,200,300,400]
pd.Series(data,countries)

USA       100
Nigra     200
France    300
Ghana     400
dtype: int64

In [8]:
import numpy as np
countries = ['USA','Nigra','France','Ghana']
datas = [100,200,300,400]
arr = np.array(datas)
pd.Series(arr)

0    100
1    200
2    300
3    400
dtype: int32

In [9]:
dict1 = {'a':50,'b':60,'c':70,'d':80}
pd.Series(dict1)

a    50
b    60
c    70
d    80
dtype: int64

In [10]:
pd.Series(5,index=['a','b','c','d','e'])

a    5
b    5
c    5
d    5
e    5
dtype: int64

In [16]:
dict2 = {'a':50,'b':60,'c':70,'d':80}
s = pd.Series(dict2)
s.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [17]:
s.size

4

In [18]:
s.values

array([50, 60, 70, 80], dtype=int64)

In [19]:
s.axes

[Index(['a', 'b', 'c', 'd'], dtype='object')]

In [20]:
s.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [22]:
s.empty

False

In [23]:
s.dtype

dtype('int64')

In [24]:
s.tail(2)

c    70
d    80
dtype: int64

In [25]:
s.count

<bound method Series.count of a    50
b    60
c    70
d    80
dtype: int64>

In [26]:
s.count()

4

In [27]:
s.value_counts()

70    1
60    1
50    1
80    1
dtype: int64

In [28]:
s1 = pd.Series([1,2,3,4],['London','HongKong','Lagos','Mumbai'])
s2 = pd.Series([1,3,6,4],['London','Accra','Lagos','Delhi'])

In [29]:
s1+s2

Accra       NaN
Delhi       NaN
HongKong    NaN
Lagos       9.0
London      2.0
Mumbai      NaN
dtype: float64

In [30]:
s1.add(s2,fill_value=0)

Accra       3.0
Delhi       4.0
HongKong    2.0
Lagos       9.0
London      2.0
Mumbai      4.0
dtype: float64

In [31]:
(s1+s2).dropna()

Lagos     9.0
London    2.0
dtype: float64

In [32]:
(s1+s2).fillna(4)

Accra       4.0
Delhi       4.0
HongKong    4.0
Lagos       9.0
London      2.0
Mumbai      4.0
dtype: float64

In [33]:
s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])
s[0]

1

In [34]:
s[:3]

a    1
b    2
c    3
dtype: int64

In [35]:
s[['a','c','d']]

a    1
c    3
d    4
dtype: int64

In [36]:
s[:5]

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [37]:
s[:4]

a    1
b    2
c    3
d    4
dtype: int64

In [38]:
s[:c]

NameError: name 'c' is not defined

In [39]:
s[a:c]

NameError: name 'a' is not defined

In [40]:
s['a']

1

In [42]:
data = [['Alex',10],['Able',12],['Fan',14]]
pd.DataFrame(data,columns=['Name','Ages'],index=[1,2,3])

   Name  Ages
1  Alex    10
2  Able    12
3   Fan    14

In [45]:
df = {'Name':pd.Series(['Jon','Aaron','Todd'],index=['a','b','c']),
      'Age':pd.Series(['39','34','32','33'],index=['a','b','c','d']),
      'Nationality':pd.Series(['US','China','US'],['a','b','c'])
     }
pd.DataFrame(df)

    Name Age Nationality
a    Jon  39          US
b  Aaron  34       China
c   Todd  32          US
d    NaN  33         NaN

In [46]:
data = {'Name':['Tom','Jack','Steve','Ricky'],'Age':[28,34,29,42]}

In [47]:
pd.DataFrame(data)

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

In [48]:
df.info()

AttributeError: 'dict' object has no attribute 'info'

In [49]:
df.index

AttributeError: 'dict' object has no attribute 'index'

In [50]:
data['Name']

['Tom', 'Jack', 'Steve', 'Ricky']

In [51]:
type(data['Name'])

list

In [52]:
pd.DataFrame(data)

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

In [53]:
type(pd.DataFrame(data))

pandas.core.frame.DataFrame

In [54]:
data = pd.DataFrame(data)

In [55]:
data

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

In [56]:
data['Name']

0      Tom
1     Jack
2    Steve
3    Ricky
Name: Name, dtype: object

In [57]:
type(data['Name'])

pandas.core.series.Series

In [58]:
type(data[['Name']])

pandas.core.frame.DataFrame

In [59]:
data[['Name']]

    Name
0    Tom
1   Jack
2  Steve
3  Ricky

In [60]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
Name    4 non-null object
Age     4 non-null int64
dtypes: int64(1), object(1)
memory usage: 192.0+ bytes

In [61]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [66]:
df['three'] = pd.Series([10,20,30],index=['a','b','c'])
df['four'] = df['Name'] + df['Age']
df

KeyError: 'Name'

In [63]:
df = {'one':pd.Series(['Jon','Aaron','Todd'],index=['a','b','c']),
      'two':pd.Series(['39','34','32','33'],index=['a','b','c','d']),
     }
pd.DataFrame(df)

     one two
a    Jon  39
b  Aaron  34
c   Todd  32
d    NaN  33

In [68]:
df['three'] = pd.Series([10,20,30],index=['a','b','c'])
df['four'] = df['one'] + df['two']
pd.DataFrame(df)

     one two  three     four
a    Jon  39   10.0    Jon39
b  Aaron  34   20.0  Aaron34
c   Todd  32   30.0   Todd32
d    NaN  33    NaN      NaN

In [75]:
df = {'one':pd.Series([1,2,3],index=['a','b','c']),
      'two':pd.Series([2,3,4,5],index=['a','b','c','d'])
     }
pd.DataFrame(df)

   one  two
a  1.0    2
b  2.0    3
c  3.0    4
d  NaN    5

In [76]:
df['three'] = pd.Series([10,20,30],index=['a','b','c'])
df['four'] = df['one'] + df['two']
pd.DataFrame(df)

   one  two  three  four
a  1.0    2   10.0   3.0
b  2.0    3   20.0   5.0
c  3.0    4   30.0   7.0
d  NaN    5    NaN   NaN

In [77]:
del df['three']
del df['four']
pd.DataFrame(df)

   one  two
a  1.0    2
b  2.0    3
c  3.0    4
d  NaN    5

In [78]:
df.pop('two')
pd.DataFrame(df)

   one
a    1
b    2
c    3

In [79]:
df = {'one':pd.Series([1,2,3],index=['a','b','c']),
      'two':pd.Series([2,3,4,5],index=['a','b','c','d'])
     }
pd.DataFrame(df)

   one  two
a  1.0    2
b  2.0    3
c  3.0    4
d  NaN    5

In [80]:
df['three'] = pd.Series([10,20,30],index=['a','b','c'])
df['four'] = df['one'] + df['two']
pd.DataFrame(df)

   one  two  three  four
a  1.0    2   10.0   3.0
b  2.0    3   20.0   5.0
c  3.0    4   30.0   7.0
d  NaN    5    NaN   NaN

In [96]:
data1 = pd.DataFrame(df)

In [97]:
data1.loc(['b'])

TypeError: unhashable type: 'list'

In [98]:
data = {'one':pd.Series([1,2,3],index=['a','b','c']),
      'two':pd.Series([2,3,4,5],index=['a','b','c','d']),
      'three':pd.Series([1,2,3,4],index=['a','b','c','d']),
      'four':pd.Series([2,4,6,8],index=['a','b','c','d'])
     }

In [109]:
dff = pd.DataFrame(data)
dff

   one  two  three  four
a  1.0    2      1     2
b  2.0    3      2     4
c  3.0    4      3     6
d  NaN    5      4     8

In [105]:
type(dff)

pandas.core.frame.DataFrame

In [106]:
dfa = dff.iloc[2]

In [107]:
dfa

one      3.0
two      4.0
three    3.0
four     6.0
Name: c, dtype: float64

In [108]:
dfb = dff.iloc[2][0]
dfb

3.0

In [111]:
dff.drop(['four'],axis=1)

   one  two  three
a  1.0    2      1
b  2.0    3      2
c  3.0    4      3
d  NaN    5      4

In [112]:
dff

   one  two  three  four
a  1.0    2      1     2
b  2.0    3      2     4
c  3.0    4      3     6
d  NaN    5      4     8

In [113]:
df1 = pd.DataFrame([[1,2],[3,4]],columns = ['a','b'])
df2 = pd.DataFrame([[5,6],[7,8]],columns = ['a','b'])
df3 = df1.append(df2)

In [114]:
df3

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

In [115]:
df4 = df1.drop(0)
df4

   a  b
1  3  4

In [3]:
dfff = pd.DataFrame(np.random.randn(5,3),index=['a','c','e','f','h'],columns=['one','two','three'])
dfff = dfff.reindex(['a','b','c','d','e','f','g','h'])

NameError: name 'pd' is not defined

In [2]:
dfff

NameError: name 'dfff' is not defined

In [1]:
dfff.fillna(method='bfill')

NameError: name 'dfff' is not defined

In [5]:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.randn(5,3),index=['a','c','e','f','h'],columns=['one','two','three'])
df = df.reindex(['a','b','c','d','e','f','g','h'])

In [6]:
df

        one       two     three
a  0.607911  1.294145  0.150577
b       NaN       NaN       NaN
c  1.096596 -1.319337  0.881636
d       NaN       NaN       NaN
e  1.087286  1.059217  2.066677
f  0.354733 -0.536246 -2.486076
g       NaN       NaN       NaN
h -2.803664  0.079868 -0.341543

In [7]:
df.fillna(method='pad')

        one       two     three
a  0.607911  1.294145  0.150577
b  0.607911  1.294145  0.150577
c  1.096596 -1.319337  0.881636
d  1.096596 -1.319337  0.881636
e  1.087286  1.059217  2.066677
f  0.354733 -0.536246 -2.486076
g  0.354733 -0.536246 -2.486076
h -2.803664  0.079868 -0.341543

In [8]:
df.fillna(method='bfill')

        one       two     three
a  0.607911  1.294145  0.150577
b  1.096596 -1.319337  0.881636
c  1.096596 -1.319337  0.881636
d  1.087286  1.059217  2.066677
e  1.087286  1.059217  2.066677
f  0.354733 -0.536246 -2.486076
g -2.803664  0.079868 -0.341543
h -2.803664  0.079868 -0.341543

In [10]:
df.dropna(axis=0,how='all')

        one       two     three
a  0.607911  1.294145  0.150577
c  1.096596 -1.319337  0.881636
e  1.087286  1.059217  2.066677
f  0.354733 -0.536246 -2.486076
h -2.803664  0.079868 -0.341543

In [13]:
df = pd.DataFrame({'one':[10,20,30,40,50,2000],'two':[1000,0,30,40,50,60]})

In [14]:
df.replace({1000:10,2000:60})

   one  two
0   10   10
1   20    0
2   30   30
3   40   40
4   50   50
5   60   60

In [15]:
df.describe()

               one          two
count     6.000000     6.000000
mean    358.333333   196.666667
std     804.373462   394.089668
min      10.000000     0.000000
25%      22.500000    32.500000
50%      35.000000    45.000000
75%      47.500000    57.500000
max    2000.000000  1000.000000

In [19]:
one = pd.DataFrame({
    'Name':['Alex','Amy','Allen','Alice','Ayoung'],
    'subject_id':['sub1','sub2','sub4','sub6','sub5'],
    'Marks_scored':[98,90,87,69,78]},
    index = [1,2,3,4,5]
    )
two = pd.DataFrame({
    'Name':['Billy','Brian','Bran','Bryce','Betty'],
    'subject_id':['sub2','sub4','sub3','sub6','sub5'],
    'Marks_scored':[89,80,79,97,88]},
    index = [1,2,3,4,5]
    )
rs = pd.concat([one,two],axis = 1)
rs

     Name subject_id  Marks_scored   Name subject_id  Marks_scored
1    Alex       sub1            98  Billy       sub2            89
2     Amy       sub2            90  Brian       sub4            80
3   Allen       sub4            87   Bran       sub3            79
4   Alice       sub6            69  Bryce       sub6            97
5  Ayoung       sub5            78  Betty       sub5            88

In [21]:
data = pd.read_csv('magic.csv',skiprows=2)
data

,"http://www.zillow.com/b/603-W-140th-St-New-York-NY/40.82376,-73.95335_ll/",10 photos,Unnamed: 2,10,Unnamed: 4,10 photos.1,10.1,"http://www.zillow.com/b/603-W-140th-St-New-York-NY/40.82376,-73.95335_ll/.1",603 W 140th St,"603 W 140th St APT 44, New York, NY Real Estate",...,Unnamed: 13,"603 W 140th St, New York, NY",603; 140.1,2 matching units,2,Unnamed: 18,Updated today,"1 Bedrooms $2,100 1.0 ba 800 sqft; 2 Bedrooms $2,595 1.0 ba 1,000 sqft",2100; 2595,1
0,http://www.zillow.com/homedetails/9-E-129th-St...,NaN,NaN,NaN,NaN,NaN,NaN,http://www.zillow.com/homedetails/9-E-129th-St...,"9 E 129th St # 1, New York, NY10035","9 E 129th St # 1, New York, NY Real Estate",...,1750.0,1 bd 1 ba,1; 1,NaN,NaN,48.0,minutes ago,NaN,NaN,1
1,http://www.zillow.com/homedetails/710-Riversid...,9 photos,NaN,9.0,NaN,9 photos,9.0,http://www.zillow.com/homedetails/710-Riversid...,"710 Riverside Dr APT 2C, New York, NY10031","710 Riverside Dr APT 2C, New York, NY Real Estate",...,3000.0,"2 bds 2 ba 1,016 sqft",2; 2; 1016,NaN,NaN,1.0,hour ago,NaN,NaN,1
2,http://www.zillow.com/homedetails/413-E-84th-S...,5 photos,NaN,5.0,NaN,5 photos,5.0,http://www.zillow.com/homedetails/413-E-84th-S...,"413 E 84th St APT 8, New York, NY10028","413 E 84th St APT 8, New York, NY Real Estate",...,2300.0,Studio 1 ba,1,NaN,NaN,2.0,hours ago,NaN,NaN,1
3,http://www.zillow.com/homedetails/324-Pleasant...,7 photos,NaN,7.0,NaN,7 photos,7.0,http://www.zillow.com/homedetails/324-Pleasant...,"324 Pleasant Ave APT 6E, New York, NY10035","324 Pleasant Ave APT 6E, New York, NY Real Estate",...,2500.0,2 bds 1 ba,2; 1,NaN,NaN,2.0,hours ago,NaN,NaN,1
4,http://www.zillow.com/b/159-Prince-St-New-York...,3 photos,NaN,3.0,NaN,3 photos,3.0,http://www.zillow.com/b/159-Prince-St-New-York...,159 Prince St,"159 Prince St APT 2, New York, NY Real Estate",...,NaN,"159 Prince St, New York, NY",159,4 matching units,4.0,NaN,Updated today,"1 Bedrooms $2,650+ 1.0 ba -- sqft",2650,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
493,http://www.zillow.com/b/562-W-End-Ave-New-York...,NaN,NaN,NaN,NaN,NaN,NaN,http://www.zillow.com/b/562-W-End-Ave-New-York...,562 W End Ave,"562 W End Ave APT 7D, New York, NY Real Estate",...,NaN,"562 W End Ave, New York, NY",562,3 matching units,3.0,NaN,NaN,"Studios $2,950 1.0 ba -- sqft; 1 Bedrooms $2,8...",2950; 2800,20
494,http://www.zillow.com/homedetails/445-W-49th-S...,4 photos,NaN,4.0,NaN,4 photos,4.0,http://www.zillow.com/homedetails/445-W-49th-S...,"445 W 49th St APT 3B, New York, NY10019","445 W 49th St APT 3B, New York, NY Real Estate",...,2195.0,Studio 1 ba,1,NaN,NaN,NaN,NaN,NaN,NaN,20
495,http://www.zillow.com/homedetails/203-E-121st-...,4 photos,NaN,4.0,NaN,4 photos,4.0,http://www.zillow.com/homedetails/203-E-121st-...,"203 E 121st St APT 901, New York, NY10035","203 E 121st St APT 901, New York, NY Real Estate",...,1795.0,Studio 1 ba 550 sqft,1; 550,NaN,NaN,NaN,NaN,NaN,NaN,20
496,http://www.zillow.com/b/325-E-48th-St-New-York...,4 photos,NaN,4.0,NaN,4 photos,4.0,http://www.zillow.com/b/325-E-48th-St-New-York...,325 E 48th St,"325 E 48th St # 22, New York, NY Real Estate",...,NaN,"325 E 48th St, New York, NY",325; 48,2 matching units,2.0,NaN,NaN,"Studios $2,195+ 1.0 ba -- sqft",2195,20
497,http://www.zillow.com/homedetails/434-E-72nd-S...,1 photo,NaN,1.0,NaN,1 photo,1.0,http://www.zillow.com/homedetails/434-E-72nd-S...,"434 E 72nd St APT 2C, New York, NY10021","434 E 72nd St APT 2C, New York, NY Real Estate",...,2150.0,1 bd 1 ba,1; 1,NaN,NaN,NaN,NaN,NaN,NaN,20